{
        "_id": "684d6dd996d0e4fb31d2b838",
        "page_id": 923,
        "title": "As an Administrator how do I setup a new user,staff member is Practice Management?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/As an Administrator how do I setup a new user,staff member is Practice Management?",
        "content": "**Question** \nAs an Administrator how do I setup a new user/staff member is Practice Management?\n\n**Answer**\nIf you are acting as the Administrator and are responsible for creating User Accounts for staff at\nyour practice there is a two step process, firstly setting up the Staff Member record then the User.\n\nTo setup the Staff Member record, choose File | New | New Staff Member (If you the user isn't going\nto complete a Time sheet within Practice Management the only mandatory field here is the Full\nName, you should however enter the staff's email address in the Contact Details section if the user is\ngoing to be interacting with Onvio).\n\nIf the user is going to complete a Time sheet you will need to add their charge out rate, to do this;\nclick Action | Charge-out Rates (Alternatively click on the £ icon) and enter the details as necessary\n(ensure you enter the valid from date from the user started) by clicking on New or Edit and click OK to\nsave the details as illustrated below\n![image.png](/.attachments/image-cfd0c009-06e0-43c2-bb21-519fd8c97aca.png)\nOnce the Staff Member record is setup we need to create the User, choose Tools | Manage Users and click New\n![image.png](/.attachments/image-a8a8733f-ddd4-41b6-ba1f-741bca8e768d.png)\nTo enter the User name click on the Ellipsis button to the right of the User Name field (If you user\nDigita Virtual Office (DVO) this will display a list of your firms Staff that have been setup to access\nDVO which can be selected)\nIn the Enter the object name to select box enter the users Windows log In name.\n![image.png](/.attachments/image-c807f1bd-84d0-4dc7-860b-e82246354843.png)\nPress Check Names to validate the user (If you get an error message saying that the user cannot be\nfound you can press the Advanced button then Find Now to display all of users setup on your firms\nnetwork, you can then select the user from this list).\nPress OK to pull the validated user it through to the New User screen.\nTo link the Staff Member record to the User press the button to the right of the Staff Member box,\nthis will open a list of the Staff Members that have been setup on the system, double click on the\nrequired user and press OK.\nYou can now choose the User's Role from the dropdown list.\nFinally press OK, the user you have setup will now be able to access Practice Management and if\nrequired enter time on their Time Sheet\n\n[As an Administrator how do I setup a new user_staff member is Practice Management.pdf](/.attachments/As%20an%20Administrator%20how%20do%20I%20setup%20a%20new%20user_staff%20member%20is%20Practice%20Management-d7cb4914-9c98-4f4c-b2b1-cad92e38cf35.pdf)"
    },
    {
        "_id": "684d6dd996d0e4fb31d2b839",
        "page_id": 924,
        "title": "Can I edit a finalised invoice if a mistake has been made?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Can I edit a finalised invoice if a mistake has been made?",
        "content": "**Question** \nCan I edit a finalized invoice if a mistake has been made?\n\n**Answer**\nFinalised invoices are locked down, apart from allowing you to add WIP or remove WIP from\nthe existing bill lines.\n\nCurrently there is no way to edit the details contained in a finalised invoice within Practice\nManagement if a mistake has been made. So a Credit Note needs to be raised to cancel\nout the invoice on the ledger and a fresh invoice will then need to be created containing the\ncorrect information.\n\nIf WIP has been added to the original invoice, you can remove this (so that it is available to\npull through to the replacement invoice) by opening the invoice and going into the bill line(s):\nRight click on the WIP entry and select Remove WIP. Save & Close the bill line. Save &\nClose the invoice.\n\nThe development team are aware that several customers have indicated that they would like\nthe ability to make minor edits to finalised bills - such as editing the description - and they\nare looking to enhance the program to allow this in a future upgrade.\nIf it is just a minor error on the return, such as a slight spelling mistake, then you may wish\nto elect to export the invoice to RTF so that you can edit the customer's copy in Word, rather\nthan create a fresh invoice, but please bear in mind that the invoice details saved in the\ndatabase will remain unchanged.\n\n[Can I edit a finalised invoice if a mistake has been made.pdf](/.attachments/Can%20I%20edit%20a%20finalised%20invoice%20if%20a%20mistake%20has%20been%20made-c0ed988a-2f91-480a-849e-5e1903e06f74.pdf)"
    },
    {
        "_id": "684d6dda96d0e4fb31d2b83a",
        "page_id": 925,
        "title": "Client summary Tax Gadget. Message says check the 'DPT Server', and 'DPT Database Name' options of the gadget",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Client summary Tax Gadget. Message says check the 'DPT Server', and 'DPT Database Name' options of the gadget",
        "content": "**Question**\nClient summary Tax Gadget. Message says check the 'DPT Server', and 'DPT Database Name' options of the gadget.\n\n**Answer**\nTo review / set the \"DPT Server\" and the \"DPT Database Name\" options for the gadget*, highlight the\nclient name in the top right hand corner of the client summary screen, so that the orange drop down\narrow appears and select Personalize Content from the menu.\n\nThen hover over the 'Tax Liability Gadget' heading so that the orange drop down arrow appears and\nselect Options from the menu:\n\nThe DPT Database Name will normally be 'TaxyWin'.\n\nThe DPT Server default is 'localhost'. Please change this to show the name of your server.\n\nIf the message now disappears, but the required figures are not shown as expected. This is because\nyou have not yet set Windows Authentication for Personal, Business & Trust Tax within Database\nsecurity for the User(s)... See link below.\n\n* Log on as The Administrator to set this globally. If any Users have already personalised their view\nthis will not be over-written, but they can elect to \"Reset Content\" and accept the Administrator's new\nsettings by hovering over the client name in the top right hand corner of the Client Summary Screen,\nso the orange drop down arrow appears and selecting Reset Content from the menu.\n\n[Client summary Tax Gadget. Message says check the DPT Server, and 'DPT Database Name options of the gadget.pdf](/.attachments/Client%20summary%20Tax%20Gadget.%20Message%20says%20check%20the%20DPT%20Server,%20and%20'DPT%20Database%20Name%20options%20of%20the%20gadget-38c0c37d-ff90-4f57-b99d-d941893aded7.pdf)"
    },
    {
        "_id": "684d6ddb96d0e4fb31d2b83b",
        "page_id": 927,
        "title": "Digita Forms Update (July 2022)",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Digita Forms Update (July 2022)",
        "content": "**Question:** Digita Forms Update (July 2022)\n\n**Answer**\nIn order to install any forms that have been updated since the last release of the Practice Management\nsoftware (22.0 build 3937) please paste the link below into a web browser to access the updated forms.\n\nThe updated forms included in this download are:\n\nP11D (2022), P60 (2022), P60e (2022) and the 64-8 (2022)\n\n[LINK](https://productdownloads.digita.com/gtax.knowledgebase/PracticeManagement/83685/Forms_Update_July_2022.zip)\n\nOnce the file is downloaded extract the folder(s) and file(s) to the location where your Digita Practice\nManagement forms are currently stored. This is likely to be on a central server location in the Digita |\nPractice Management | Forms | Inland Revenue folder (You can check this by logging into Practice\nManagement as Administrator and going into Tools | Options | General Options, Defaults tab).\n\n![image.png](/.attachments/image-f44d1711-911d-471f-b2cd-e32636e12c6b.png)\nOnce the files has been saved, you then need to open the Forms Editor software (via Start | All\nPrograms | Digita | Digita Practice Management | Digita Forms Editor) and go to Edit | Add Form(s)\nThen click on the Refresh button.\n![image.png](/.attachments/image-ae4d9fed-48d9-4e55-aac2-4c3520db33bb.png)\nYou should now be able to open the new forms from within Practice Management.\n\n[Digita Forms Update July 2022.pdf](/.attachments/Digita%20Forms%20Update%20July%202022-2eed656e-7174-466d-a00d-3b714a7e8fba.pdf)"
    },
    {
        "_id": "684d6ddc96d0e4fb31d2b83c",
        "page_id": 928,
        "title": "Document Creation - How do I setup and run a mail merge",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How do I setup and run a mail merge",
        "content":"**Question** How do I setup and run a mail merge (Document Creation)\n\n**Answer**\nIn order to run a mail merge, you will first need to set up a template, to do this;\n1. Select Tools | Manage Office Document templates.\n2. You then have the option to create a new template, modify an existing template or clone a template.\nThere are various reports supplied with the software which may help setting up your templates\n- Blank address: A blank template with the basic address merge fields.\n- Engagement cover: Contains the address fields and some example text.\n- Marketing demo: Also contains the address fields and some example text.\n- Label: Setup to enable you to create labels, however you would need to edit the template to suit the\ntype of label you are printing.\n3. Having selected the method of editing the template, Microsoft Word will open and will enable you to\nenter the text in the body of the template. You can also select the merge fields to use from the Mailings\ntab, and selecting insert merge field.\n(Please note, if you add a Header and/or Footer the details contained will only appear if you elect to\nview the document for printing. If you wish these details to also be available if the document is used\nfor emails, please ensure ALL details are added to the main body of the template, and not added as a\nheader or footer, as headers and footers are stripped out when the details go onto email).\n4. Once you have the information and the desired template format save the file. This will save the\ntemplate to the Practice Management Templates folder and is now ready to use with your Practice\nManagement client data.\nTo create the mail merge:\n1. From the client or contact list highlight the entities you would like to create a document for.\n2. Select the option to “Create office document”, this will launch the Mail merge wizard.\n3. Click Next.\n4. Select Generate a document using a template and click Next.\n5. Select a template from the list and click Next\n6. Add a Reference and/or Signatory as required. Ensure you have included the Signature merge\ndata field in your selected template; otherwise the signature will not be included.\n7. Choose where to save the documents to. Select the Save to FileCabinet/Save to client/Contact\nfolder check boxes as required. Specify the default filename format by selecting your chosen\nparameters from the drop-down list using the button. You can also enter any additional text to create a\ncustomised filename. Any standard characters valid for filenames are allowed; invalid characters\ninclude /\\:*?\"<>|. Click Next.\n8. Set any additional options. Select the Save datasource file check box to save the file as a CommaSeparated (.csv) file.\nSelect the Add note to each recipient's contact history check box and specify a note to track who\nhas received letters. These appear on the Notes lists on the General tab, and is a useful way to track\nwho has received letters.\n9. Click Next.\n10. Select how you wish to send the document.\nIf you select Open document for printing:\n1. The letters are created in a Word document.\n2. You are asked to select to print each document separated by page breaks or section breaks. Click\nNext.\n3. View the Wizard summary to confirm the details and template are correct. Click Next to create the\ndocuments.\n4. Print the documents, then close and save the file for future reference.\n5. If you wish to save these steps, for use again as a Fast Letter please tick the box to Save Settings\nto Database (or leave the box unticked if not applicable). Click Finish to close the Wizard.\nIf you select Send documents via email:\n1. Digita Practice Management requests access to your email application. The emails are sent from\nthe account to which you grant access via this dialog.\nThis does not apply any signatures specified via your email application. Therefore you may wish to\nedit templates to include any required signature and disclaimer information.\n2. Enter a title in the Subject field. This field is mandatory.\n3. Choose whether to send the documents as an attachment or in the body of the email.\n4. In the Output field, select whether to:\n- Send the emails immediately\n- Save the emails in your Drafts folder\n- Open each email.\n5. The emails are sent to the primary email for each selected contact/client. If there is no valid email\nspecified for a contact/client you are warned and asked whether to proceed. Clients are not able to\nsee the other recipients on the list, each email only contains one client in the To: field.\n6.If you specified a Note it is only applied to clients/contacts that have had the email successfully sent.\nYou may want to set up some categories for each set of emails. You can then select this category on\nthis note, to signify the contacts/clients that have received the email.\nIf you select I do not wish to send the documents:\nThe documents are created and saved to the clients' folders.\n\n[Document Creation - How do I setup and run a mail merge.pdf](/.attachments/Document%20Creation%20-%20How%20do%20I%20setup%20and%20run%20a%20mail%20merge-95c2ba28-7431-4a18-9f13-a7a42fea9233.pdf)"
    },
    {
        "_id": "684d6ddc96d0e4fb31d2b83d",
        "page_id": 929,
        "title": "Document Creation - How to add a user input field when running a mail merge in Practice Management",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to add a user input field when running a mail merge in Practice Management",
        "content": "**Question** Document Creation - How to add a user input field when running a mail merge in Practice Management\n\n**Answer**\nMicrosoft Word includes a Fill-in field which enables you to enter your own text at a certain point\nwithin a document when running a mail merge.\nTo include a Fill-in field as part of a mail merge:\n- Edit the Mail merge template from the Tools | Manage Office Document Templates, select\nthe relevant template and modify.\n- To insert a fill-in field, place the cursor on the location in the template where you want the\ninformation to be displayed.\n- On the Mailings tab, in the Write & Insert Fields group, click Rules, and then click Fill-in.\n- In the Prompt box, type the question you want answered.\n- If you want a predefined response, type the response in the Default fill-in text box.\n- If you want the same response to apply to all the records in the merge, select the Ask once\ncheck box. If you do not check this you will be prompted to enter the information included in\nyour mail merge for each document.\nNow when you run the mail merge you will be prompted (when the Practice Management mail merge\nwizard has completed) to enter the text you want to display in the Fill-in field.\n\n[Document Creation - How to add a user input field when running a mail merge in Practice Management.pdf](/.attachments/Document%20Creation%20-%20How%20to%20add%20a%20user%20input%20field%20when%20running%20a%20mail%20merge%20in%20Practice%20Management-eb702ce6-4b0b-4b5c-a0f5-0460b4a040ec.pdf)"
    },
    {
        "_id": "684d6ddd96d0e4fb31d2b83e",
        "page_id": 931,
        "title": "Document Creation - How to change the date format in a word document, so that does not appear as DD,MM,YYYY 00:00:00",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to change the date format in a word document, so that does not appear as DD,MM,YYYY 00:00:00",
        "content": "**Question** \nDocument Creation - How to change the date format in a word document, so that does not appear as DD/MM/YYYY 00:00:00\n\n**Answer**\nAny dates, such as date of birth or year end, are pulled from the database as DateTime types, so you\nwill need to format the field in the Word Template to the desired format.\nTo do this:\n- Open the template - You should be able to see the merge fields e.g. «RecipientYearEnd»\n- Hold down ALT and press F9 - This will display the merge field code e.g. {MERGEFIELD\n\"RecipientYearEnd\" }\n- Edit this to read the format you require e.g. 31 January {MERGEFIELD\n\"RecipientYearEnd\" \\@ \" DD MMMM\"}\n- Hold down ALT and press F9 to return to normal mode\n- Save the template.\nWhen you now run the merge process the dates will be presented as 31 January rather than\n31/01/2000 00:00:00\n\n[Document Creation - How to change the date format in a word document, so that does not appear as DD_MM_YYYY 00_00_00.pdf](/.attachments/Document%20Creation%20-%20How%20to%20change%20the%20date%20format%20in%20a%20word%20document,%20so%20that%20does%20not%20appear%20as%20DD_MM_YYYY%2000_00_00-b9104f01-6ffe-493b-a55b-44b797da5915.pdf)"
    },
    {
        "_id": "684d6dde96d0e4fb31d2b83f",
        "page_id": 933,
        "title": "Document Creation - How to email a file to client using Practice Management",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to email a file to client using Practice Management",
        "content": "To send a file to multiple clients from Practice Management follow the guidance below.\n1. From the client or contact list highlight the entities you would like to send the file too.\n2. Select the option to Create office document, this will launch the Mail merge wizard.\n3. Click Next.\n4. Select Select a Document to File or Email and click Next.\n5. Press the ellipsis button to select the file you wish to send, click Next.\n6. On the next dialog choose Next\n7. On the Email Options dialog, enter the subject of the email in the Subject field. This\nfield is mandatory.\n8. Choose whether to send the documents as an attachment or in the body of the email\n(If you choose to send as an attachment type what you want to be in the body of the\nemail in the Body section).\n9. In the Output field, select whether to:\n- Send the emails immediately\n- Save the emails in your Drafts folder\n- Open each email.\n10. Click Next\n11. The emails are sent to the primary email for each selected contact/client. If there is\nno valid email specified for a contact/client you are warned and asked whether to\nproceed. Clients are not able to see the other recipients on the list, each email only\ncontains one client in the To: field.\n12. Select Finish\n\n[Document Creation - How to email a file to client using Practice Management.pdf](/.attachments/Document%20Creation%20-%20How%20to%20email%20a%20file%20to%20client%20using%20Practice%20Management-4b82f44c-b3cf-407a-b283-cf75b8610a12.pdf)"
    },
    {
        "_id": "684d6de096d0e4fb31d2b840",
        "page_id": 935,
        "title": "Document Creation - How to produce a mail merge document with figures from Personal, Business and Trust Tax?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to produce a mail merge document with figures from Personal, Business and Trust Tax?",
        "content": "**Question** How to produce a mail merge document with figures from Personal, Business and Trust Tax?\n\n**Answer**\nYou are able to create letter in Practice Management which pull figures from Personal, Business & Trust Tax\nBefore you are able to create the document using the Document Creator function in Practice\nManagement you need to ensure you have setup Windows Authentication in Personal, Business\nand Trust Tax.\nHow to set Windows Authentication in Personal, Business & Trust Tax.\nYou will also need to turn on a setting in Practice Management you to choose which tax years details\nare pulled through.\nThe setting is in Advanced Options (You will need to be logged in as the Administrator (File | Log on\nas Administrator)) then Tools | Options | Advanced Options.\nThe required setting is Doc. data options, find this and double click and set this to True\nWith this option set you will be prompted to choose the Tax Year each time you create a Mail Merge\nletter in Practice Management\nOnce these two steps have been carried out you are all set to start creating your templates letters.\nTo see how to create a Mail Merge and send to your clients please see this article\nHow do I setup and run a mail merge\nHow to create an email mail merge.\nYou can see a list of which fields are available to pull through into your templates from Personal,\nBusiness and Trust Tax by going into the Help in Practice Management and searching for 'Merge\nData'\n![image.png](/.attachments/image-f3b2e5d0-84d9-4062-9b9e-e5c05657a578.png)\nWe would advise that you produce an Excel spreadsheet in Practice Management to see which\nfigures pull through to which field allowing you to choose the correct one to use in your letter\n\n[Document Creation - How to produce a mail merge document with figures from Personal, Business and Trust Tax.pdf](/.attachments/Document%20Creation%20-%20How%20to%20produce%20a%20mail%20merge%20document%20with%20figures%20from%20Personal,%20Business%20and%20Trust%20Tax-e01386b5-3855-4733-9b8a-33106e7ada15.pdf)"
    },
    {
        "_id": "684d6de196d0e4fb31d2b841",
        "page_id": 937,
        "title": "Document Creation - How to run a mail merge for 2nd Payment on Account Tax letters and ignore those records where there is nothing payable?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to run a mail merge for 2nd Payment on Account Tax letters and ignore those records where there is nothing payable?",
        "content": "**Question** \nHow to run a mail merge for 2nd Payment on Account Tax letters and ignore those records where there is nothing payable?\n\n**Answer**\nHow to create a template that can be used to run a mail merge for all Personal Tax Clients in respect\nof payments due by 31 July (2nd Payment on account) and exclude the records where there is nothing\npayable\n\nWithin your Word template, it is possible to add a 'field code' in the Mail Merge called \"SkipIf\", which\nyou can set to ignore certain records if they meet certain criteria. For example,SKIPIf \"Payment Due\"\n= 0.00. SkipIf will then skip that client and move onto the next.\n\n[Document Creation - How to run a mail merge for 2nd Payment on Account Tax letters and ignore those records where there is nothing payable.pdf](/.attachments/Document%20Creation%20-%20How%20to%20run%20a%20mail%20merge%20for%202nd%20Payment%20on%20Account%20Tax%20letters%20and%20ignore%20those%20records%20where%20there%20is%20nothing%20payable-73986aed-830e-486a-b67f-8928db12f33c.pdf)"
    },
    {
        "_id": "684d6de296d0e4fb31d2b842",
        "page_id": 938,
        "title": "Document Creation - How to save and use Fast Letters in Practice Management",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to save and use Fast Letters in Practice Management",
        "content": "**Question** Document Creation - How to save and use Fast Letters in Practice Management\n\n**Answer**\nYou can save the selections made during the creation of a document after going through the steps in\nthe Mail Merge Wizard as a macro, so that every time you wish to create the document from then on\nyou don't have to go through the selection process again.\n\nOnce you have been through the steps to run a mail merge, the Finish option within the Mail Merge\nWizard gives you the option to Save Settings to Database.\n\nIf you tick this box, you can save the selections made use again in the future without having to re\nselect the same options. You will need to give the Fast Letter a name to identify this instance and\nthen select Finish\n![image.png](/.attachments/image-8c066c03-8c88-42b1-9c08-b37561239832.png)\nNow if you select one or more clients from the client list for whom you wish to create a document in\nthe future and right click; you will have the option to select Create Fast Letter and then select the\nrelevant instance which will automatically select all the options you saved.\n![image.png](/.attachments/image-67974a0b-aeb8-49ea-9eac-a8b9bb5aea0b.png)\nConfigurations saved are only available to the individual user who has saved them. If you wish to\nsave Fast Letters at a global level that are available for everyone to use, you will need to login as the\nAdministrator (File | Login as Administrator) and go through the mail merge process and save the\noptions.\n\n[Document Creation - How to save and use Fast Letters in Practice Management.pdf](/.attachments/Document%20Creation%20-%20How%20to%20save%20and%20use%20Fast%20Letters%20in%20Practice%20Management-e9e909b2-699f-4617-a0c2-5031f7909097.pdf)"
    },
    {
        "_id": "684d6de296d0e4fb31d2b843",
        "page_id": 939,
        "title": "Document Creation - How to set up a mail merge template to include the date created and not automatically update when the client document is opened in the future",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - How to set up a mail merge template to include the date created and not automatically update when the client document is opened in the future",
        "content": "**Question** \nDocument Creation - How to set up a mail merge template to include the date created and not\nautomatically update when the client document is opened in the future.\n\n**Answer**\nYou can add a date field to your letter templates that will retain the date the letter was created. This\ndate won't update each time the saved letter is opened.\nTo do this we can use the QUOTE function, this turns the output into a string rather than a field so it\ndoesn’t get updated.\nYou will need to create a merge field with the following content on the mail merge template:\n{QUOTE {DATE \\@ \"dd/MM/yyy\"} }\nTo enter this you need to:\n1. Display field codes (ALT+F9)\n2. Then use CTRL+F9 to enter create the {}\n3. Type QUOTE then CTRL+F9 again to give {QUOTE{}}\n4. Then type DATE \\@\"dd/MM/yyyy\" to give {QUOTE{DATE \\@\"dd/MM/yyyy\"}}\n5. Then turn off field code display (ALT+F9)\n\n\n[Document Creation - How to set up a mail merge template to include the date created and not automatically update when the client document is opened in the future.pdf](/.attachments/Document%20Creation%20-%20How%20to%20set%20up%20a%20mail%20merge%20template%20to%20include%20the%20date%20created%20and%20not%20automatically%20update%20when%20the%20client%20document%20is%20opened%20in%20the%20future-7ca45e82-e04b-4d36-9969-e5dea89872fa.pdf)"
    },
    {
        "_id": "684d6de396d0e4fb31d2b844",
        "page_id": 940,
        "title": "Document Creation - Mail merge shows random letters and,or symbols when sending a document as an email",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - Mail merge shows random letters and,or symbols when sending a document as an email",
        "content": "**Problem** Mail merge shows random letters and/or symbols when sending a document as an email.\n\n**Solution**\nCurrently there is no solution to this issue, the short term solution is to create a Word template (Tools >\nManage Office Document Templates) and issue the mail merge using the create office document,\n\"Generate a document using a template\" option and opt to send this document as an e-mail.\n\nAlternatively, you can use the \"send the document or file via e-mail\" option, but opt to send the file as\nan attachment, rather than in the body of the e-mail.\n\n[Document Creation - Mail merge shows random letters and_or symbols when sending a document as an email.pdf](/.attachments/Document%20Creation%20-%20Mail%20merge%20shows%20random%20letters%20and_or%20symbols%20when%20sending%20a%20document%20as%20an%20email-8f5f62e2-3a4f-46df-bec4-c0b18da4142f.pdf)"
    },
    {
        "_id": "684d6de496d0e4fb31d2b845",
        "page_id": 942,
        "title": "Document Creation - What mail merge fields are available to add to the Word and Excel templates?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - What mail merge fields are available to add to the Word and Excel templates?",
        "content": "**Question**\nDocument Creation - What mail merge fields are available to add to the Word and Excel templates?\n\n\n**Answer**\nTo see a list of merger fields available to use in your Word templates open Digita Practice\nManagement go to Help | Digita Practice Management Help. Go on to the Search tab and select\nsearch for About Merge Data.\n\n[Document Creation - What mail merge fields are available to add to the Word and Excel templates.pdf](/.attachments/Document%20Creation%20-%20What%20mail%20merge%20fields%20are%20available%20to%20add%20to%20the%20Word%20and%20Excel%20templates-8885a858-0a73-45b7-a601-04520dd08850.pdf)"
    },
    {
        "_id": "684d6de596d0e4fb31d2b846",
        "page_id": 943,
        "title": "Document Creation - Why do I get the message 'Word cannot find it''s data source...' when trying to run, modify or create a letter?",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Document Creation - Why do I get the message 'Word cannot find it''s data source...' when trying to run, modify or create a letter?",
        "content": "**Question**\nDocument Creation - Why do I get the message 'Word cannot find it''s data source...' when trying to run, modify or create a letter?\n\n\n**Answer**\nIf you get the following error message when opening a template\n![image.png](/.attachments/image-12b209ed-b69b-4922-b52a-3e8ba05652e7.png)\nYou will need to reattach the correct Clientdata.csv file as the data source of the letter.\n\nFirst, you will need to find out the location of data source file by logging on as Administrator (File |\nLog on as Administrator) and going into Tools | Options | General Options and selecting the\nDefaults tab. The data source file can be found on the path in the Datasource file'.\n\nNow that you know the location, please go into Manage Office Document Templates, click on the\naffected template and click on Modify. You may get a splash screen saying that an error has occurred\nas object path could not be found and asking you to check it... click OK\n\nYou will then be prompted to Find Data Source. Please browse to pick up the default path to the Data\nsource file.\n\nWhen the document opens select the Mailings tab | Select Recipients | Use Existing List\n![image.png](/.attachments/image-6039eac8-36a7-40ef-8dbc-4082a4a072a2.png)\nAgain locate the relevant csv data source file. When prompted select OK, and then save the\ntemplate.\n\nThis template will now have the correct data source file and you should be able to use this in Practice\nManagement without any further errors.\n\nAny new documents that are created should now automatically be created using the correct csv data\nsource file.\n\n[Document Creation - Why do I get the message Word cannot find it''s data source... when trying to run, modify or create a letter.pdf](/.attachments/Document%20Creation%20-%20Why%20do%20I%20get%20the%20message%20Word%20cannot%20find%20it''s%20data%20source...%20when%20trying%20to%20run,%20modify%20or%20create%20a%20letter-b59f7040-a6da-4dec-8a83-547dbe4a1106.pdf)"
    },
    {
        "_id": "684d6de596d0e4fb31d2b847",
        "page_id": 945,
        "title": "DPM - Query did not return a unique result: 2",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/DPM - Query did not return a unique result: 2",
        "content":"**Problem** \nA 'Query did not return a unique result: 2' error appears when an Onvio login prompt usually would.\n\n![image.png](/.attachments/image-7b75e1bb-c9fb-4d5d-91c8-5c30ab82da55.png)\nThe above error appears when a login prompt for Onvio would usually pop-up, such as starting the esigning process or viewing historic e-signing submissions.\n\n**Solution **\nThis issue is caused by too many Practice Management users being mapped to the same active\ndirectory or domain user account. This is most likely due to domain name changes and/or windows\nuser account name changes\n\nTo solve the issue, you will need to ensure that all historic Practice Management users are removed\nvia the 'Tools' > 'Manage users' window. When these old/unused accounts are deleted, please\nrestart Practice Management and the error should no longer appear.\n\n[DPM - Query did not return a unique result 2.pdf](/.attachments/DPM%20-%20Query%20did%20not%20return%20a%20unique%20result%202-5da39858-bbb6-43d2-93b9-2d3d99fec803.pdf)"
    },
    {
        "_id": "684d6de796d0e4fb31d2b848",
        "page_id": 947,
        "title": "Error adding time to the Time sheet; 'Service Provided is mandatory'",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Error adding time to the Time sheet; 'Service Provided is mandatory'",
        "content": "**Problem** Error adding time to the Time sheet; 'Service Provided is mandatory'\n\n**Solution**\nWhen adding time to the time sheet the staff member gets the following error\n![image.png](/.attachments/image-055ec7de-5e26-4726-9710-8ae0936b11b7.png)\nThis error will occur if the “Service on WIP” setting within the Advanced Options has been set to false (To view this\nselect File | Log on as Administrator. Then select Tools | Options | Advanced Options);\n![image.png](/.attachments/image-f9268dec-1636-4a0b-b2d0-55e22341674f.png)\nIn order to resolve the error every staff member needs to have a Primary service set.\nTo do this;\n- Open the staff card and click on the Employment tab.\n- Remove the tick from the \"Engaged with all services\" box.\n- Select New and highlight the relevant services the staff member provides and select OK\n- To set the Primary service, double click on the intended Primary service.\n- Tick the Primary service box\nClose and re-open Digita Practice Management Now when you enter time the Primary service will be\nselected by default.\n\n[Error adding time to the Time sheet Service Provided is mandatory.pdf](/.attachments/Error%20adding%20time%20to%20the%20Time%20sheet%20Service%20Provided%20is%20mandatory-bc756bea-a000-4ffe-b366-840a51d4ddfa.pdf)"
    },
    {
        "_id": "684d6de896d0e4fb31d2b849",
        "page_id": 949,
        "title": "Error Message 'The field 'Code' must have a unique value. The field 'Code' is invalid. You must correct the error before this form can be saved'",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Error Message 'The field 'Code' must have a unique value. The field 'Code' is invalid. You must correct the error before this form can be saved'",
        "content": "**Problem**\nError Message 'The field 'Code' must have a unique value. The field 'Code' is invalid. You must correct the error before this form can be saved'.\n\n**Solution**\nEach code applied within the Practice Management database must be unique. If you attempt to use\nthe same code again this error message will appear.\n![image.png](/.attachments/image-5d3ef111-8dda-4eba-862a-8cf9c164dd6f.png)\nPlease navigate to the Contact List (rather than the Client List) as this shows ALL the records in the database. Filter / sort to identify the record that already has the code: you can then decide whether to either re-code the original record - to allow you to use the code now or keep the code assigned to the original record and add a new code to the affected record.\n\nPlease note that the code field is only mandatory for Client records. If a record is in the database as a Contact only the code field can be left blank if you wish.\n\n[Error Message 'The field 'Code' must have a unique value. The field 'Code' is invalid. You must correct the error before this form can be saved.pdf](/.attachments/Error%20Message%20'The%20field%20'Code'%20must%20have%20a%20unique%20value.%20The%20field%20'Code'%20is%20invalid.%20You%20must%20correct%20the%20error%20before%20this%20form%20can%20be%20saved-fa9ff202-5fbc-4c1d-83e3-2d7aa4b0b22c.pdf)"
    },
    {
        "_id": "684d6dea96d0e4fb31d2b84a",
        "page_id": 951,
        "title": "Error Message 'Unhandled exception has occurred in your application... If you click continue and access the affected record, the boxes are inc named as uilabel or label1",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Error Message 'Unhandled exception has occurred in your application... If you click continue and access the affected record, the boxes are inc named as uilabel or label1",
        "content": "**Problem**\nError Message 'Unhandled exception has occurred in your application... If you click continue and\naccess the affected record, the boxes are incorrectly named as uilabel or label1\n\n**Solution**\nThe main body of the address for the affected client will be blank; this is causing the error.\nSelect Tools | Manage addresses\nFind and edit the relevant address for the client.\nSave and close out of Practice Management, then re-launch and you should be able to go into the\nclient without error.\n\n[Error Message 'Unhandled exception has occurred in your application... If you click continue and access the affected record, the boxes are incorrectly named as uilabel or label1.pdf](/.attachments/Error%20Message%20'Unhandled%20exception%20has%20occurred%20in%20your%20application...%20If%20you%20click%20continue%20and%20access%20the%20affected%20record,%20the%20boxes%20are%20incorrectly%20named%20as%20uilabel%20or%20label1-ccc7d3d9-82a3-49fe-9593-a3ceadef2ee4.pdf)"
    },
    {
        "_id": "684d6deb96d0e4fb31d2b84b",
        "page_id": 953,
        "title": "Error when launching DPM \"Unable to cast object of type 'System.DBNull' to type 'System.String'",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Error when launching DPM \"Unable to cast object of type 'System.DBNull' to type 'System.String'",
        "content": "**Problem**\nError when launching DPM \"Unable to cast object of type 'System.DBNull' to type 'System.String'.\n\n![image.png](/.attachments/image-fb784b7a-7b88-4e6d-b789-ba88472d0eed.png)\n\nRun script to clear Listcache in SSMS\nUse Practice management\nUPDATE ListCache\nSET Dirty='true'\nEXEC dbo.UpdateListCache\n\n[Error when launching DPM Unable to cast object of type 'System.DBNull to type 'System.String'.pdf](/.attachments/Error%20when%20launching%20DPM%20Unable%20to%20cast%20object%20of%20type%20'System.DBNull%20to%20type%20'System.String'-c6522a09-3a5e-40be-85b0-3d33fa602a5d.pdf)"
    },
    {
        "_id": "684d6dec96d0e4fb31d2b84c",
        "page_id": 954,
        "title": "Error: Word cannot give a document the same name as an open document",
        "path": "/Wiki - TAP UK Support/Wikipedia/Supported programs/DIGITA/Practice Management/Error: Word cannot give a document the same name as an open document",
        "content": "**Problem**\nError: Word cannot give a document the same name as an open document.\n\n**Solution**\nThe error below appears if you are producing an office document, such as an email, for multiple clients and the File name format for each of the documents is identical... and consequently only one email is produced\n![image.png](/.attachments/image-d879b254-5ffb-4c1d-827e-3b573fbbb50e.png)\nIf the document name format only has the fields for 'date' and / or 'document name' selected this means that all documents created using the mail merge functionality at this point in time will have identical names and this results in the error occurring and only the first document is produced.\n\nBy adding the field 'client code' each document produced will have a unique name and the mail merge process will work successfully.\n\nThe document name format can either be set for individual mail merges when going through the steps in the mail merge wizard or set as a default format by the Administrator (log in as Administrator by going into the File drop down menu and selecting 'log on as Administrator') in Tools > Options > General Options and going into the Filenames tab.\n\n[Error Word cannot give a document the same name as an open document.pdf](/.attachments/Error%20Word%20cannot%20give%20a%20document%20the%20same%20name%20as%20an%20open%20document-350f3226-311d-4b40-8024-558e4765c963.pdf)"
    },